Revit 2027 API
View.GetCategoryOverrides Method
 Gets graphic overrides for a category in view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings GetCategoryOverrides(
	ElementId categoryId
)
Public Function GetCategoryOverrides (
	categoryId As ElementId
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ GetCategoryOverrides(
	ElementId^ categoryId
)
member GetCategoryOverrides :
        categoryId : ElementId -> OverrideGraphicSettings
Parameters
categoryId ElementId
 Category to be checked.
Return Value
OverrideGraphicSettings
 Object representing all graphic overrides of the category categoryId in view. A default OverrideGraphicSettings object will be returned if it not previously been set for this view.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The view type does not support Visibility/Graphics Overriddes.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace